{
  "quotes": [
    {
      "text": "“I do not fear computers. I fear lack of them.” - Isaac Asimov"
    },
    {
      "text": "“A computer once beat me at chess, but it was no match for me at kick boxing.” - Emo Philips"
    },
    {
      "text": "“Computer Science is no more about computers than astronomy is about telescopes.” - Edsger W. Dijkstra"
    },
    {
      "text": "“The computer was born to solve problems that did not exist before.” - Bill Gates"
    },
    {
      "text": "“Software is like entropy: It is difficult to grasp, weighs nothing, and obeys the Second Law of Thermodynamics; i.e., it always increases.” - Norman Augustine"
    },
    {
      "text": "“Software is a gas; it expands to fill its container.” - Nathan Myhrvold"
    },
    {
      "text": "“Standards are always out of date.  That’s what makes them standards.” - Alan Bennett"
    },
    {
      "text": "“Physics is the universe’s operating system.” - Steven R Garman"
    },
    {
      "text": "“It’s hardware that makes a machine fast.  It’s software that makes a fast machine slow.” - Craig Bruce"
    },
    {
      "text": "“The greatest enemy of knowledge is not ignorance, it is the illusion of knowledge.” - Stephen Hawking"
    },
    {
      "text": "“The more you know, the more you realize you know nothing.” - Socrates"
    },
    {
      "text": "“Tell me and I forget.  Teach me and I remember.  Involve me and I learn.” - Benjamin Franklin"
    },
    {
      "text": "“Real knowledge is to know the extent of one’s ignorance.” - Confucius"
    },
    {
      "text": "“If people never did silly things, nothing intelligent would ever get done.” - Ludwig Wittgenstein"
    },
    {
      "text": "“Getting information off the Internet is like taking a drink from a fire hydrant.” - Mitchell Kapor"
    },
    {
      "text": "“If you think your users are idiots, only idiots will use it.” - Linus Torvalds"
    },
    {
      "text": "“From a programmer’s point of view, the user is a peripheral that types when you issue a read request.” - P. Williams"
    },
    {
      "text": "“Where is the ‘any’ key?” - Homer Simpson, in response to the message, “Press any key”"
    },
    {
      "text": "“Computers are good at following instructions, but not at reading your mind.” - Donald Knuth"
    },
    {
      "text": "“There is only one problem with common sense; it’s not very common.” - Milt Bryce"
    },
    {
      "text": "“Your most unhappy customers are your greatest source of learning.” - Bill Gates"
    },
    {
      "text": "“The Internet?  We are not interested in it.” - Bill Gates, 1993"
    },
    {
      "text": "“In a room full of top software designers, if two agree on the same thing, that’s a majority.” - Bill Curtis"
    },
    {
      "text": "“Programs must be written for people to read, and only incidentally for machines to execute.” - Abelson and Sussman"
    },
    {
      "text": "“We have to stop optimizing for programmers and start optimizing for users.” - Jeff Atwood"
    },
    {
      "text": "“Low-level programming is good for the programmer’s soul.” - John Carmack"
    },
    {
      "text": "“It’s OK to figure out murder mysteries, but you shouldn’t need to figure out code.  You should be able to read it.” - Steve McConnell"
    },
    {
      "text": "“If we wish to count lines of code, we should not regard them as ‘lines produced’ but as ‘lines spent.'” - Edsger Dijkstra"
    },
    {
      "text": "“Programming can be fun, so can cryptography; however they should not be combined.” - Kreitzberg and Shneiderman"
    },
    {
      "text": "“Before software should be reusable, it should be usable.” - Ralph Johnson"
    },
    {
      "text": "“If you automate a mess, you get an automated mess.” - Rod Michael"
    },
    {
      "text": "“Looking at code you wrote more than two weeks ago is like looking at code you are seeing for the first time.” - Dan Hurvitz"
    },
    {
      "text": "“It is easier to change the specification to fit the program than vice versa.” - Alan Perlis"
    },
    {
      "text": "“If you have a procedure with ten parameters, you probably missed some.” - Alan Perlis"
    },
    {
      "text": "“Simplicity, carried to the extreme, becomes elegance.” - Jon Franklin"
    },
    {
      "text": "“A program is never less than 90% complete, and never more than 95% complete.” - Terry Baker"
    },
    {
      "text": "“The best way to predict the future is to implement it.” - David Heinemeier Hansson"
    },
    {
      "text": "“We need above all to know about changes; no one wants or needs to be reminded 16 hours a day that his shoes are on.” - David Hubel"
    },
    {
      "text": "“Make everything as simple as possible, but not simpler.” - Albert Einstein"
    },
    {
      "text": "“Today, most software exists, not to solve a problem, but to interface with other software.” - IO Angell"
    },
    {
      "text": "“Good specifications will always improve programmer productivity far better than any programming tool or technique.” - Milt Bryce"
    },
    {
      "text": "“The difference between theory and practice is that in theory, there is no difference between theory and practice.” - Richard Moore"
    },
    {
      "text": "“As a rule, software systems do not work well until they have been used, and have failed repeatedly, in real applications.” - Dave Parnas"
    },
    {
      "text": "“If the code and the comments do not match, possibly both are incorrect.” - Norm Schryer"
    },
    {
      "text": "“I think it’s a new feature.  Don’t tell anyone it was an accident.” - Larry Wall"
    },
    {
      "text": "“When debugging, novices insert corrective code; experts remove defective code.” - Richard Pattis"
    },
    {
      "text": "“In a software project team of 10, there are probably 3 people who produce enough defects to make them net negative producers.” - Gordon Schulmeyer"
    },
    {
      "text": "“I think it is inevitable that people program poorly.  Training will not substantially help matters.  We have to learn to live with it.” - Alan Perlis"
    },
    {
      "text": "“Program testing can be a very effective way to show the presence of bugs, but is hopelessly inadequate for showing their absence.” - Edsger Dijkstra"
    },
    {
      "text": "“There’s no obfuscated Perl contest because it’s pointless.” - Jeff Polk"
    },
    {
      "text": "“Java is the most distressing thing to hit computing since MS-DOS.” - Alan Kay"
    },
    {
      "text": "“There are only two things wrong with C++:  The initial concept and the implementation.” - Bertrand Meyer"
    },
    {
      "text": "“BASIC is to computer programming as QWERTY is to typing.” - Seymour Papert"
    },
    {
      "text": "“It has been discovered that C++ provides a remarkable facility for concealing the trivial details of a program — such as where its bugs are.” - David Keppel"
    },
    {
      "text": "“UNIX is simple.  It just takes a genius to understand its simplicity.” - Dennis Ritchie"
    },
    {
      "text": "“Some people, when confronted with a problem, think ‘I know, I’ll use regular expressions.’  Now they have two problems.” - Jamie Zawinski"
    },
    {
      "text": "“The only truly secure system is one that is powered off, cast in a block of concrete and sealed in a lead-lined room with armed guards.” - Gene Spafford"
    },
    {
      "text": "“I am not out to destroy Microsoft, that would be a completely unintended side effect.” - Linus Torvalds"
    },
    {
      "text": "“Two years from now, spam will be solved.” - Bill Gates, 2004"
    },
    {
      "text": "“The problem of viruses is temporary and will be solved in two years.” - John McAfee, 1988"
    },
    {
      "text": "“Computer viruses are an urban legend.” - Peter Norton, 1988"
    },
    {
      "text": "“In 2031, lawyers will be commonly a part of most development teams.” - Grady Booch"
    },
    {
      "text": "“In the future, computers may weigh no more than 1.5 tonnes.” - Popular mechanics, 1949"
    },
    {
      "text": "“I see little commercial potential for the Internet for at least ten years.” - Bill Gates, 1994"
    },
    {
      "text": "Some of you are so focused on the cheese, that you forget about the trap - Unknown"
    },
    {
      "text": "So I go to a pizza place, and I see a sign, it says “Wood fired Pizza“. And I say to myself, “Wood fired pizza? How`s pizza meant to get a job now!?“ - Michael Quinlan"
    },
    {
      "text": "“Fail to prepare, prepare to fail“ - YC"
    },
    {
      "text": "“Quitters never win. Winners never quit“ - DDM"
    },
    {
      "text": "“Buy high, sell low“ - Anonymous"
    },
    {
      "text": "“Lions, they don't compare themselves to humans“ - Zlatan"
    },
    {
      "text": "“When seagulls follow the trawler, it is because they think sardines will be thrown into the sea“ - Eric Cantona"
    },
    {
      "text": "“If you think you're the smartest person in the room, you're definitely not“ - GTY"
    },
    {
      "text": "“My father once told me that the sky's the limit, which disappointed me because I wanted to be an astronaut“ - Min-Dog"
    },
    {
      "text": "““ - "
    }
  ]
}